'''
Запросить число от 1 до 12. 
Если ввели другое число сообщить об ошибке. 
Если ввели не число сообщить об ошибке. 
Когда введут допустимое число - вывести на экран соответствующее 
название месяца, пору года и сколько дней в данном месяце.

'''

a = {
    1: {"month":"Январь", "time_of_year":"Зима", "days":31},
    2: {"month":"Февраль", "time_of_year":"Зима", "days":28},  # Не учитываем високосный год для простоты
    3: {"month":"Март", "time_of_year":"Весна", "days":31},
    4: {"month":"Апрель", "time_of_year":"Весна", "days":30},
    5: {"month":"Май", "time_of_year":"Весна", "days":31},
    6: {"month":"Июнь", "time_of_year":"Лето", "days":30},
    7: {"month":"Июль", "time_of_year":"Лето", "days":31},
    8: {"month":"Август", "time_of_year":"Лето", "days":31},
    9: {"month":"Сентябрь", "time_of_year":"Осень", "days":30},
    10: {"month":"Октябрь", "time_of_year":"Осень", "days":31},
    11: {"month":"Ноябрь", "time_of_year":"Осень", "days":30},
    12: {"month":"Декабрь", "time_of_year":"Зима", "days":31}
}

num = input("Введите число от 1 до 12: ")

if num.isdigit():
    num_1 = int(num)
    if num_1<1 or num_1>12:
        print("Ошибка. Вы ввели другое число")
    elif num_1 in range(1,13):
        data = a.get(num_1)
        print(f"Число {num_1} соответствует этим данным: {data}")
else:
    print("Ошибка. Вы ввели не число.")